# CanHaveAnalyticalModel Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
Element..::..CanHaveAnalyticalModel Method
Element Class See Also
---
Indicates whether the Element can have an Analytical Model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool CanHaveAnalyticalModel()
```

Visual Basic
---
```text
Public Function CanHaveAnalyticalModel As Boolean
```

Visual C++
---
```text
public:
bool CanHaveAnalyticalModel()
```

# ### Return Value
True if the Element can have an Analytical Model, false otherwise.
# See Also
Element Class
Autodesk.Revit.DB Namespace